      * https://www.codewars.com/kata/526571aae218b8ee490006f4/cobol
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BIT_COUNTER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ABIN    PIC 9(8) USAGE IS BINARY.
       01 BBIN    PIC 9(8) USAGE IS BINARY.

       LINKAGE SECTION.
       01 N       PIC 9(8).
       01 RESULT  PIC 9(20).

       PROCEDURE DIVISION USING N RESULT.
           MOVE 0 TO RESULT.
           PERFORM CALC UNTIL N = 0.
           GOBACK.

       CALC.
           MOVE N TO ABIN.
           SUBTRACT 1 FROM N GIVING BBIN.
           CALL "CBL_AND" USING ABIN BBIN BY VALUE 8.
           MOVE BBIN TO N.
           ADD 1 TO RESULT GIVING RESULT.

       END PROGRAM BIT_COUNTER.